---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.SpotDimensionFloatingPointError
source: html/c81180c6-734c-808c-f552-471772ea9819.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.SpotDimensionFloatingPointError Property

Some spot dimensions contain invalid floating-point values.

## Syntax (C#)
```csharp
public static FailureDefinitionId SpotDimensionFloatingPointError { get; }
```